package addPracticeTasks.practice_Kirill_Telephon;
//Условия
// 1. Создать абстрактный класс с полем год выпуска и методом звонить, в который будет передан номер телефона
// 2. Создать структуру классов такого вида, что
//Абстрактный телефон -> абстрактный беспроводной телефон (имеет свое поле, часы работы от батареи) -> кнопочный телефон
//Абстрактный телефон -> телефон эдиссона
//Абстрактный телефон -> видео телефон -> смартфон
//для смартфона реализовать:
//- работу с доп полем - тип операционной системы
//- метод установки программы, которая будет передана как String параметр в метод. В момент вызова метода установки
//распечатать, параметр переданный в метод и тип операционной системы
//- в методе вызова дополнительно задействовать механизм установки программы Skype
//
// Абстрактный телефон -> классический телефон
//
//4.Создать класс Пользователь с полем имя, и методом вызова абонента. В качестве мараметров в метод передать
// номер телефона и сам телефон
// 5. Создать класс с методом main
// 6. Создать несколько объектов разных телефонов с типом AbstractPhone
// 7. Создать объект пользователя
// 8. Вызвать у пользователя метод вызова абонента, передав необходимые аргументы (номер телефона и реализацию
// телефона)
public class Telephon {
}
