package addPracticeTasks.practice_27_09_23_task;
//1. Описание проекта
//        Цель проекта состоит в создании программы для управления задачами и
//        задачным списком. Проект будет включать минимум 3 класса с шестью полями
//        в каждом, а также класс для обработки задач с шестью методами, использующими циклы.
//
//        2. Классы
//        2.1. Класс "Task"
//        Поля:
//
//
//        2.2. Класс "User"
//        Поля:
//
//
//        2.3. Класс "TaskManager"
//        Поля:
//        taskList (List<Task>): Список всех задач.
//        userList (List<User>): Список всех зарегистрированных пользователей.
//        Методы:
//
//public List<Task> listHighPriorityTasks(): Метод, который возвращает список задач с
//        высоким приоритетом.
//public List<Task> listTasksByStatus(String status): Метод, который возвращает список
//        задач с указанным статусом.
//public Map<String, Integer> countTasksByStatus(): Метод, который возвращает отображение
//        (Map) со статусами задач и количеством задач в каждом статусе.
//public void createTask(Task task): Метод, который создает новую задачу и добавляет ее в
//        список задач.
//public void assignTask(User user, Task task): Метод, который назначает задачу пользователю.
//public void updateTaskStatus(Task task, String newStatus): Метод, котоый обновляет статус задачи.
//
//        3. Обработка данных
//        Задачи будут создаваться, назначаться, обновляться и фильтроваться с использованием
//        методов класса "TaskManager". Данные
//        о задачах и пользователях будут храниться в соответствующих объектах классов "Task" и "User".
public class Main {
}
